In [41]:
import pandas as pd
from sklearn.model_selection import train_test_split

In [26]:
data=pd.read_csv(r"D:\Titanic Dataset\Titanic Dataset.csv")

In [32]:
data.head()

   Pclass     Sex       Age  SibSp  Parch    Fare  Survived
0       2  female  29.00000      1      0  26.000         1
1       3    male  29.70056      0      0   8.050         0
2       2    male  39.00000      0      0  26.000         0
3       3  female  29.00000      0      4  21.075         0
4       3    male  25.00000      0      0   7.050         0

In [28]:
data.describe()

           Pclass         Age       SibSp       Parch        Fare    Survived
count  668.000000  536.000000  668.000000  668.000000  668.000000  668.000000
mean     2.296407   29.700560    0.528443    0.407186   32.064552    0.402695
std      0.831638   14.240257    1.080327    0.854695   45.320835    0.490808
min      1.000000    0.670000    0.000000    0.000000    0.000000    0.000000
25%      2.000000   21.000000    0.000000    0.000000    7.925000    0.000000
50%      3.000000   29.000000    0.000000    0.000000   14.750000    0.000000
75%      3.000000   38.250000    1.000000    0.000000   31.275000    1.000000
max      3.000000   80.000000    8.000000    6.000000  512.329200    1.000000

In [29]:
data.isnull().sum()

Pclass        0
Name          0
Sex           0
Age         132
SibSp         0
Parch         0
Ticket        0
Fare          0
Cabin       514
Embarked      1
Survived      0
dtype: int64

In [30]:
data["Age"].fillna(data["Age"].mean(),inplace=True)

data["Embarked"].fillna(data["Embarked"].mode()[0],inplace=True)

In [31]:
data.drop(['Name','Ticket','Cabin','Embarked'],axis=1,inplace=True)

In [34]:
def Sex_Num(gender):
    
    if(gender=='male'):
        return 1
    else:
        return 0

In [38]:
data['sex']=data['Sex'].apply(Sex_Num)

data.drop('Sex',axis=1,inplace=True)

In [39]:
data.head()

   Pclass       Age  SibSp  Parch    Fare  Survived  sex
0       2  29.00000      1      0  26.000         1    0
1       3  29.70056      0      0   8.050         0    1
2       2  39.00000      0      0  26.000         0    1
3       3  29.00000      0      4  21.075         0    0
4       3  25.00000      0      0   7.050         0    1

In [40]:
X=data.drop("Survived",axis=1)
Y=data["Survived"]

In [ ]:
X_train , X_test , Y_train , Y_test=train_test_split(X,Y)